#!/usr/bin/env python
# -*- coding: utf-8 -*-


"""
一条包含字母 A-Z 的消息通过以下映射进行了 编码 ：

'A' -> 1
'B' -> 2
...
'Z' -> 26
要 解码 已编码的消息，所有数字必须基于上述映射的方法，反向映射回字母（可能有多种方法）。例如，"111" 可以将 "1" 中的每个 "1" 映射为 "A" ，从而得到 "AAA" ，或者可以将 "11" 和 "1"（分别为 "K" 和 "A" ）映射为 "KA" 。注意，"06" 不能映射为 "F" ，因为 "6" 和 "06" 不同。

给你一个只含数字的 非空 字符串 num ，请计算并返回 解码 方法的 总数 。

题目数据保证答案肯定是一个 32 位 的整数。

 

示例 1：

输入：s = "12"
输出：2
解释：它可以解码为 "AB"（1 2）或者 "L"（12）。
示例 2：

输入：s = "226"
输出：3
解释：它可以解码为 "BZ" (2 26), "VF" (22 6), 或者 "BBF" (2 2 6) 。
示例 3：

输入：s = "0"
输出：0
解释：没有字符映射到以 0 开头的数字。含有 0 的有效映射是 'J' -> "10" 和 'T'-> "20" 。由于没有字符，因此没有有效的方法对此进行解码，因为所有数字都需要映射。
示例 4：

输入：s = "06"
输出：0
解释："06" 不能映射到 "F" ，因为字符串开头的 0 无法指向一个有效的字符。 
 

提示：

1 <= s.length <= 100
s 只包含数字，并且可能包含前导零。


来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/decode-ways
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。

"""


class Solution:
    def numDecodings(self, s: str) -> int:
        if not s or s[0] == "0":
            return 0
        # 使用 dp 算法同步修改策略方式
        size = len(s)
        dp = [0] * (size + 1)
        # 如果为空，那么这个也是只有一种类型。
        dp[0] = dp[1] = 1

        for i in range(1, size):
            # 这里需要注意，i-1是高位，i为低位
            # 如果 低位=0，那么只有 10/20 为正常，其只有一种类型 dp[i] = dp[i-2]
            # 如果 高位=1，那么 dp[i] = dp[i-1]+dp[i-2]  因为可以进行组合
            # 如果 高位=2，低位<=6 那么 dp[i] = dp[i-1]+dp[i-2]  这里因为可以进行组合
            #            低位>6，那么 dp[i] = dp[i-1] 因为这种只有一种情况
            if s[i] == "0":
                if s[i - 1] == "1" or s[i - 1] == "2":
                    dp[i + 1] = dp[i - 1]
                else:
                    return 0

            else:
                if s[i - 1] == "1" or (s[i - 1] == "2" and s[i] <= "6"):
                    dp[i + 1] = dp[i] + dp[i - 1]
                else:
                    dp[i + 1] = dp[i]

        return dp[-1]